Projeto02-1019/app/Controllers/Clientes.php

    public function index()
    {
        $clientes = $this->cliente_model->findAll();;
---
SELECT *
FROM `clientes`

    public function store()
    {
        $data = $this->request->getVar();

        // dd($data);
        if (isset($data['id_cliente'])):
            $this->cliente_model->where('id_cliente', $data['id_cliente'])->set($data)->update();

            return redirect()->to("/clientes/editar/{$data['id_cliente']}");
        endif;

        $this->cliente_model->insert($data);
---
INSERT INTO `clientes` (`nome`, `data_de_nascimento`, `telefone`, `endereco`, `limite_de_credito`, `created_at`, `updated_at`) VALUES ('Nícolas', '2006-08-24', '51998535215', 'Av. São Borja, 909', '5000', '2023-11-16 19:51:50', '2023-11-16 19:51:50')

    public function excluir($id_cliente)
    {
        $cliente = $this->cliente_model->where('id_cliente', $id_cliente)->delete();
---
DELETE FROM `clientes`
WHERE `id_cliente` = '5'

    public function exibir($id_cliente)
    {
        $cliente = $this->cliente_model->where('id_cliente', $id_cliente)->first();
---
SELECT *
FROM `clientes`
WHERE `id_cliente` = '6'
 LIMIT 1